    "use strict";

    // Задача 1

// Объявите переменную, не задавая ей значения. Выведите значение созданной переменной на экран.

    let a;
    console.log(a);

    // Задача 2

    // Присвойте переменной значение null. Выведите эту переменную на экран.

    let b = null;
    console.log(b);

    // Задача 3

    // Присвойте переменной значение true. Выведите эту переменную на экран.

    let c = true;
    console.log(c);

    // Задача 4

    // Присвойте переменной значение false. Выведите эту переменную на экран.

    let d = false;
    console.log(d);

    // Задача 5

    // Сделайте две строки. Перемножьте их друг на друга. Выведите результат умножения на экран.

    let a1 = 'Java' * 'Script';

    console.log(a1);

        // Задача 6

    // Поделите число 10 на 0. Выведите результат на экран.

    let b1 = 10 / 0;

    console.log(b1);

    // Задача 7

    // Поделите число -190 на 0. Выведите результат на экран.

    b1 = -190 / 0;

    console.log(b1);
