    "use strict";

    // Задача 1

    // Создайте переменную str и присвойте ей строку '!!!'. Выведите значение этой переменной на экран.

    let str = '!!!';

    console.log(str);

    // Задача 2

    // Создайте переменную с текстом 'java' и переменную с текстом 'script'. С помощью этих переменных и операции сложения строк выведите на экран строку 'javascript'.

    let a = 'Java';
    let b = 'Script';

    console.log(a + b);

    // Задача 3
    // Создайте переменную с текстом 'hello' и переменную с текстом 'world'. С помощью этих переменных и операции сложения строк выведите на экран строку 'hello world'.

    let c = 'Hello';
    let d = 'World';
    console.log(c + ' ' + d);

    // Задача 4

    // Запишите в переменную какую-нибудь строку. Выведите на экран длину вашей строки.

    let e = 'Example ';

    console.log(e.length);

    // Задача 5

    // Запишите в переменную str строку, состоящую из символов 'a', 'b', 'c', причем после каждого символа, кроме последнего, должен стоять перенос строки. Выведите значение переменной на экран.

    let str_ = `a
    b
    c`;

    console.log(str_);

