    "use strict";

    // №1

    // Создайте переменную num и присвойте ей значение 123. Выведите значение этой переменной на экран с помощью функции alert.

    let num = 123;

    alert(num);

    // №2

    // Самостоятельно опробуйте все описанные способы объявления переменных.

    let a = 1;
    let b = 2;
    let c = 3;

    let d = 4, e = 5, f = 6;
    
    let g, h, i;
    g = 7;
    h = 8;
    i = 9;

    document.write(a, b, c, d, e, f, g, h, i);

    // №3

    // Создайте переменную a. Запишите в нее значение 10, выведите его на экран. Затем запишите в нее значение 20, выведите его на экран.

    let a1 = 10;
    alert(a1);

    a1 = 20;
    alert(a1);
