    "use strict";

    // №1

    // Не запуская код, определите, что выведется на экран:

    // let a = 5 + 5 * 3;
    // alert(a);

    // (20)


    // №2

    // Не запуская код, определите, что выведется на экран:

    // let a = 5 + 5 * 3 + 3;
    // alert(a);

    // (23)


    // №3

    // Не запуская код, определите, что выведется на экран:

    // let a = 8 / 2 + 2;
    // alert(a);

    // (6)

    // №4

    // Не запуская код, определите, что выведется на экран:

    // let a = 8 + 2 / 2;
    // alert(a);

    // (9)

    // №5

    // Не запуская код, определите, что выведется на экран:

    // let a = 8 / 2 * 2;
    // alert(a);

    // (8)

    // №6

    // Не запуская код, определите, что выведется на экран:

    // let a = 8 * 4 / 2 / 2;
    // alert(a);

    // (8)

    // №7

    // Не запуская код, определите, что выведется на экран:

    // let a = (2 + 3) * (2 + 3);
    // alert(a);

    // (25)

    // №8

    // Не запуская код, определите, что выведется на экран:

    // let a = (2 + 3) * 2 + 3;
    // alert(a);

    // (13)

    // №9

    // Не запуская код, определите, что выведется на экран:

    // let a = 2 * (2 + 4 * (3 + 1));
    // alert(a);

    // (36)

    //№10

    // Не запуская код, определите, что выведется на экран:

    // let a = 2 * 8 / 4;
    // alert(a);

    // (4)

    // №11

    // Не запуская код, определите, что выведется на экран:

    // let a = (2 * 8) / 4;
    // alert(a);

    // (4)

    // №12

    // Не запуская код, определите, что выведется на экран:

    // let a = 2 * (8 / 4);
    // alert(a);

    // (4)