    "use strict";

    // Задача 1

    // Дан следующий массив:

    // let arr = ['a', 'b', 'c'];
    // Дана также переменная:

    // let key = 2;
    // Выведите на экран элемент, ключ которого хранится в переменной key.

    let arr = ['a', 'b', 'c'];
    let key = 2;

    console.log(arr[key]);

    // Задача 2

    // Дан следующий массив:

    // let arr = [1, 2, 3, 4, 5];
    // Даны также переменные:

    // let key1 = 1;
    // let key2 = 2;
    // Найдите сумму элементов, ключи которых хранятся в наших переменных.

    let arrOne = [1, 2, 3, 4, 5];
    let key1 = 1;
    let key2 = 2;

    console.log(arrOne[key1] + arrOne[key2]);

    // Задача 3

    // Дан следующий объект:

    // let obj = {'a': 1, 'b': 2, 'c': 3};
    // Дана переменная key, в которой хранится один из ключей нашего объекта. Выведите с помощью переменной key1 соответствующий элемент объекта.

    let obj = {'a': 1, 'b': 2, 'c': 3};
    let key3 = 'c';

    console.log(obj[key3]);