    "use strict";


    // Задача 1

    // В следующем коде программист вывел числа от 10 до 1:

    // let i = 10;

    // while (i >= 1) {
    //     console.log(i);
    // }

    // В коде, однако, была допущена ошибка, которая привела к тому, что цикл выполняется бесконечно. Исправьте ошибку программиста.

    let i = 10;

    while (i >= 1) {
        console.log(i);
        i--
    }

    // Задача 2

   // В следующем коде программист вывел числа от 10 до 1:
    
    // let i = 10;
    
    // while (i >= 1) {
    //     console.log(i);
    //     i++;
    // }

    // В коде, однако, была допущена ошибка, которая привела к тому, что цикл выполняется бесконечно. Исправьте ошибку программиста.



    let i1 = 10;
    
    while (i1 >= 1) {
        console.log(i1);
        i1--;
    }

    // Задача 3hash.txt: js.Pm.Lp.WM

    // В следующем коде программист вывел числа от 10 до 1:

    // let i = 10;

    // while (i <= 0) {
    //     console.log(i);
    //     i--;
    // }

    // В коде, однако, была допущена ошибка, которая привела к тому, что на экран ничего не вывелось. Исправьте ошибку программиста.


    let i2 = 10;

    while (i2 >= 1) {
        console.log(i2);
        i2--;
    }

    // Задача 4hash.txt: js.Pm.Lp.WM

    // В следующем коде программист вывел числа от 10 до 1:

    // let i = 10;

    // while (i == 0) {
    //     console.log(i);
    //     i--;
    // }

    // В коде, однако, была допущена ошибка, которая привела к тому, что на экран ничего не вывелось. Исправьте ошибку программиста.


    let i3 = 10;

    while (i3 >= 1) {
        console.log(i3);
        i3--;
    }

    // Задача 5hash.txt: js.Pm.Lp.WM

    // В следующем коде программист вывел числа от 10 до 1:

    // let i = 10;

    // while (i == 10) {
    //     console.log(i);
    //     i--;
    // }


    // В коде, однако, была допущена ошибка, которая привела к тому, что цикл вывел только число 10 и закончил свою работу. Исправьте ошибку программиста.

    let i4 = 10;

    while (i4 >= 1) {
        console.log(i4);
        i4--;
    }