    "use strict";

    // Задача 1

    // Создайте переменную num и присвойте ей значение 123. Выведите значение этой переменной на экран с помощью функции alert.

    let num = 123;
    alert(num);

    // Задача 2

    // Самостоятельно опробуйте все описанные способы объявления переменных.

    let a, b, c;
    let d = 4, e = 5, f = 6;

    a = 1;
    b = 2;
    c = 3;

    alert(a);
    alert(b);
    alert(c);

    alert(d);
    alert(e);
    alert(f);

    // Задача

    // Создайте переменную a. Запишите в нее значение 10, выведите его на экран. Затем запишите в нее значение 20, выведите его на экран.

    let t = 10;
    alert(t);

    t = 20;
    alert(t);