    "use strict";

    // Сокращенный синтаксис if-else в JavaScript

    // Задача 1

    // Если переменная test равна 10, то пусть на экран выведется слово 'верно'. В противном случае пусть ничего не произойдет.

    let test = 10;

    if (test == 10) {
    console.log('Верно');
    }

    // Задача 2

    // Перепишите следующий код в сокращенной форме:

    // if (test == 0) {
    // alert('верно');
    // } else {
    // alert('неверно!');
    // }
    let test1 = 0;

    if (test1 == 0) 
        console.log('верно');
    else 
        alert('неверно!');
        
    // Задача 3
    
    // Перепишите следующий код в сокращенной форме:

    // if (test == 0) {
    // alert('верно');
    // }

    let test2 = 0;

    if (test2 == 0) console.log('верно');

