    "use strict";

    // Задача 1

    // Найдите количество секунд в сутках.

    console.log(60 * 60 * 24);

    // Задача 2

    // Найдите количество секунд в 30 сутках.

    console.log(60 * 60 * 24 * 30);

    // Задача 3

    // Найдите количество секунд в году.

    console.log(60 * 60 * 24 * 365);

    // Задача 4

    // Найдите количество минут в сутках.

    console.log(60 * 24);

    // Задача 5

    // Найдите количество минут в году.

    console.log(60 * 24 * 365);

    // Задача 6

    // Найдите количество байт в мегабайте.

    console.log(1024 * 1024 * 1024);

    // Задача 7

    // Найдите количество байт в гигабайте.

    console.log(1024 * 1024 * 1024 * 1024);

    // Задача 8

    // Найдите количество байт в 10 гигабайтах.

    console.log(1024 * 1024 * 1024 * 1024 * 10);

    // Задача 9

    // Найдите количество байт в терабайте.

    console.log(1024 * 1024 * 1024 * 1024 * 1024);

    // Задача 10

    // Найдите количество килобайт в терабайте.

    console.log(1024 * 1024 * 1024 * 1024);

    // Задача 11

    // Пусть дана переменная r с радиусом круга. По соответствующей формуле найдите площадь круга и запишите ее в переменную s. Выведите содержимое этой переменной на экран.

    let r = 13;
    let s = r * 2 * 3.14;

    console.log(s);

    // Задача 12

    // Пусть дана переменная a со стороной квадрата. Найдите площадь квадрата и запишите ее в переменную s. Выведите содержимое этой переменной на экран.

    let t = 20;
    let s1 = 20 * 4;

    console.log(s1);

    // Задача 13

    // Пусть даны переменная a со стороной прямоугольника. Найдите площадь прямоугольника и запишите ее в переменную s. Выведите содержимое этой переменной на экран.

    let a = 5;
    let s2 = a * 2 * 3;

    console.log(s2);





