    "use strict";

    // Задача 1

    // С помощью двух вложенных циклов выведите на экран следующую строку:
    
    // 111222333444555666777888999

    for (let i = 1; i < 10; i++) {
        for (let j = 1; j < 4; j++) {
            document.write(i);
        }
    }

    // Задача 2

    // С помощью двух вложенных циклов выведите на экран следующую строку:

    // 11 12 13 21 22 23 31 32 33

    for (let i1 = 11; i1 < 34; i1++) {
        for (let k = 1; k < 2; k++) {
            if (i1 == 11 || i1 == 12 || i1 == 13) {
            document.write(i1 + ' ');
            } 
            else if (i1 == 21 || i1 == 22 || i1 == 23) {
            document.write(i1 + ' ');
            } 
            else if (i1 == 31 || i1 == 32 || i1 == 33) {
            document.write(i1 + ' ');
            }
        }
    }