    "use strict";

    // Задача 1

    // Дан следующий массив:

    // let arr = [
    //     ['a', 'b', 'c'],
    //     ['d', 'e', 'f'],
    //     ['g', 'h', 'i'],
    //     ['j', 'k', 'l'],
    // ];
    // Выведите с его помощью элементы с текстом 'l', 'e', 'g' и 'a'.

    let arr = [
    ['a', 'b', 'c'],
    ['d', 'e', 'f'],
    ['g', 'h', 'i'],
    ['j', 'k', 'l'],
    ];

    let result = arr[3][2] + arr[1][1] + arr[2][0] + arr[0][0];

    console.log(result);

    // Задача 2

    // Дан следующий массив:

    // let arr = [[1, 2], [3, 4], [5, 6]];
    // Обращаясь к каждому элементу массива найдите сумму всех его элементов.

    let arr1 = [[1, 2], [3, 4], [5, 6]];

    let result1 = 0;

    for (let elem1 of arr1) {
        for (let elem2 of elem1) {
            result1 += elem2;
        }
    }
    console.log(result1)

    // Задача 3

    // Дан следующий массив:

    // let arr = [
    //     [
    //         [1, 2],
    //         [3, 4],
    //     ],
    //     [
    //         [5, 6],
    //         [7, 8],
    //     ],
    // ];

    // Обращаясь к каждому элементу массива найдите сумму всех его элементов.

    let arr2 = [
        [
            [1, 2],
            [3, 4],
        ],
        [
            [5, 6],
            [7, 8],
        ],
    ];

   let result2 = 0;

    for (let elem of arr2) {
        for (let subElem of elem) {
            for (let subSubElem of subElem) {
            result2 += subSubElem;
            }
        }
    }
    console.log(result2);

    


    // Задача 4

    // Дан следующий массив:

    // let arr = [[1, 2, 3, [4, 5, [6, 7]]], [8, [9, 10]]]; 
    // Вручную, без цикла, найдите сумму элементов этого массива.

    let arr4 = [[1, 2, 3,[4, 5, [6, 7]]], [8, [9, 10]]];

    console.log(arr4[0][0] + arr4[0][1] + arr4[0][2] + arr4[0][3][0] + arr4[0][3][1] + arr4[0][3][2][0] + arr4[0][3][2][1] + arr4[1][0] + arr4[1][1][0] + arr4[1][1][1]);