    'use strict';
    
    
    // Задача 1

    // Если переменная test больше 10, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.

    let test = 12;

    if (test > 10) {
    console.log('верно');
    }
    else {
    console.log('не верно');
    }

    //Задача 2

    //Если переменная test меньше 10, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.let test = 5;


    let test1 = 20;

    if (test1 < 10) {
    console.log('верно');
    }
    else {
    console.log('не верно');
    }

    //Задача 3

    //Если переменная test больше или равна 10, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.

    let test2 = 10;

    if (test2 >= 10) {
    console.log('верно');
    }
    else {
    console.log('не верно');
    }

    // Задача 4

    // Если переменная test меньше или равна 10, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.

    let test3 = 0;

    if (test3 <= 10) {
    console.log('верно');
    }
    else {
    console.log('не верно');
    }

    // Задача 5

    // Если переменная test равна 10, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.

    let test4 = 10;

    if (test4 == 10) {
    console.log('верно');
    }
    else {
    console.log('не верно');
    }

    // Задача 6

    // Если переменная test не равна 10, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.

    let test5 = 10;

    if (test5 != 10) {
    console.log('верно');
    }
    else {
    console.log('не верно');
    }

    // Задача 7
    
    // Даны переменные test1 и test2. Проверьте, что значение какой из этих переменных больше и выведите соответствующее сообщение на экран.

    let test6 = 10;
    let test7 = 45;

    if (test6 > test7) {
    console.log('верно');
    }
    else {
    console.log('не верно');
    }

