    "use strict";

    // №1

    // Создайте переменную a со значением 10 и переменную b со значением 2. Выведите на экран их сумму, разность, произведение и частное (результат деления).

    let a = 10;
    let b = 2;
    alert(a + b);
    alert(a - b);
    alert(a * b);
    alert(a / b);

    // №2

    // Создайте переменную c со значением 10 и переменную d со значением 5. Просуммируйте их, а результат присвойте переменной result. Выведите на экран значение переменной result.

    let c = 10;
    let d = 5;
    let result = c + d;
    alert(result);

    // №3

    // Создайте переменную a со значением 1, переменную b со значением 2 и переменную c со значением 3. Выведите на экран их сумму.

    let a1 = 1;
    let b1 = 2;
    let c1 = 3;
    alert(a1 + b1 + c1);

    // №4

    // Создайте переменную a со значением 10 и переменную b со значением 5. Отнимите от a переменную b и результат присвойте переменной c.

    // Затем создайте переменную d, присвойте ей значение 7. Сложите переменные c и d, а результат запишите в переменную result. Выведите на экран значение переменной result.

    let a2 = 10;
    let b2 = 5;
    let c2 = a2 - b2;

    let d2 = 7;
    let result2 = c2 + d2;

    alert(result2);