    "use strict";

    // Задача 1

    // Выведите в консоль числа от 1 до 100.

    let i = 1;

    while (i <= 100) {
        console.log(i);
        i++
    }

    // Задача 2

    // Выведите в консоль числа 11 до 33.

    let j = 11;

    while (j <= 33) {
        console.log(j);
        j++
    }

    // Задача 3

    // Выведите в консоль четные числа в промежутке от 0 до 100.

    let k = 2;

    while (k <= 100) {
        console.log(k);
        k += 2;
    }

    // Задача 4

    // Выведите в консоль нечетные числа в промежутке от 1 до 99.

    let i1 = 1;

    while (i1 <= 99) {
        console.log(i1);
        i1 += 2;
    }

    // Задача 5

    // Выведите в консоль числа от 30 до 0.

    let j1 = 30;

    while (j1 >= 0) {
        console.log(j1);
        j1--;
    }