    "use strict";


    // Задача 1

    // С помощью цикла for выведите в консоль числа от 1 до 100.

    for (let i = 1; i <= 100; i++) {
        console.log(i);
    }

    // Задача 2

    // С помощью цикла for выведите в консоль числа от 11 до 33.

    for (let i1 = 11; i1 <= 33; i1++) {
        console.log(i1);
    }

    // Задача 3

    // С помощью цикла for выведите в консоль четные числа в промежутке от 0 до 100.

    for (let i2 = 0; i2 <= 100; i2 += 2) {
        console.log(i2);
    }

    // Задача 4

    // С помощью цикла for выведите в консоль нечетные числа в промежутке от 1 до 99.

    for (let i3 = 1; i3 <= 99; i3 += 2) {
        console.log(i3);
    }

    // Задача 5

    // С помощью цикла for выведите в консоль числа от 100 до 0.

    for (let i4 = 100; i4 >= 0; i4--) {
        console.log(i4);
    }