    "use strict";

    // Задача 1

    // Создайте переменную a. Запишите в нее сумму чисел 1, 2 и 3. С помощью функции alert выведите на экран содержимое переменной a.

    let a = 1 + 2 + 3;
    console.log(a); 

    // Задача 2

    // Выведите с помощью функции alert сумму чисел 1, 2 и 3.

    alert(1 + 2 + 3);

    // Задача 3

    // Создайте переменную a со значением 10 и переменную b со значением 2. Выведите на экран их сумму, разность, произведение и частное (результат деления).

    a = 10;
    let b = 2;

    console.log(a / b);

    // Задача 4

    // Создайте переменную c со значением 10 и переменную d со значением 5. Просуммируйте их, а результат присвойте переменной result. Выведите на экран значение переменной result.

    let c = 10;
    let d = 5;

    let result = c + d;

    console.log(result);

    // Задача 5

    //Создайте переменную a со значением 1, переменную b со значением 2 и переменную c со значением 3. Выведите на экран их сумму.

    a = 1;
    c = 3;

    console.log(a + b + c);

    // Задача 6

    // Создайте переменную a со значением 10 и переменную b со значением 5. Отнимите от a переменную b и результат присвойте переменной c.

    // Затем создайте переменную d, присвойте ей значение 7. Сложите переменные c и d, а результат запишите в переменную result. Выведите на экран значение переменной result.

    a = 10;
    b = 5;
    c = a - b;
    d = 7;

    result = c + d;

    console.log(result);

    // Задача 19

    // Запишите в переменную a число 1.5, а в переменную b - число 0.75. Найдите сумму значений этих переменных и выведите ее на экран.

    a = 1.5;
    b = 0.75;

    console.log(a + b);

    // Задача 20j

    // Создайте переменную a со значением -100. Выведите это значение на экран.

    a = -100;

    console.log(a);

    // Задача 21

    // Создайте переменную a, запишите в нее какое-нибудь положительное или отрицательное число. Выведите на экран это число с обратным знаком.

    a = 1000;

    console.log(-a);

    // Задача 22j

    // Дана переменная a со значением 10 и переменная b со значением 3. Найдите остаток от деления a на b.

    a = 10;
    b = 3;

    console.log(a % b);

    // Задача 23

    // Возведите число 2 в 10-ю степень. Выведите результат на экран.

    let p = 10 ** 2;

    console.log(p);

    a = 3 * 2 ** 3;
alert(a);

a = (3 * 2) ** 3;
alert(a);





